OdAnsiString.freeData(OdStringDataA*)
\details
Frees the specified StringData object.
\param pStringData [in]  Pointer to the StringData object.

OdAnsiString.safeStrlen(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns the length of the specified string.
\param string [in]  0 terminated string or NULL.
\remarks
Returns 0 if string == NULL.

OdAnsiString.release
\details
Releases the reference to the specified StringData object.
\param pStringData [in]  Pointer to the StringData object.
\remarks
If pStringData is not specified, the StringData associated with
this String object is released.
Decrements the reference count of the StringData object.
When its reference count reaches zero, the StringData object is freed.

OdAnsiString.copyBeforeWrite
\details
Assures there are no multiple references to the StringData associated with this String object.
\remarks
If there is more than one reference to the StringData object, it is released, and
replaced with a copy thereof

OdAnsiString.allocBuffer(System.Int32)
\details
Allocates the specified number of characters for the character buffer of this String object.
\param length [in]  buffer length.

OdAnsiString.allocCopy(OdAnsiString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32,System.Int32,System.Int32)
\details
Copies the specified number of characters from this String object to the destination String object.
\param destString [out]  Destination string.
\param copyLength [in]  Number of characters to copy.
\param copyIndex [in]  First byte to copy.
\param extraLength [in]  Extra characters to allocate.
\remarks
This function calls allocBuffer(copyLength + extraLength)

OdAnsiString.init
\details
Initializes this String object to an empty string.

OdAnsiString.getData
\details
Returns the StringData for this String object.

OdAnsiString.m_pchData
\details
Pointer to the underlying char array (buffer).

OdAnsiString.getAllocLength
\details
Returns the number of characters allocated for the underlying char array (buffer) in this String object.

OdAnsiString.unlockBuffer
\details
Disables reference counting for this String object.

OdAnsiString.lockBuffer
\details
Enables reference counting for this String object.

OdAnsiString.freeExtra
\details
Releases any unused memory allocated by this String object.

OdAnsiString.getBufferSetLength(System.Int32)
\details
Returns a modifiable C style char array (buffer) of of the specified length for this String object.
\param length [in]  buffer length.
\remarks
releaseBuffer() should be called before using any other OdAnsiString methods.
The pointer returned by this function is not valid after releaseBuffer() is called.

OdAnsiString.releaseBuffer(System.Int32)
\details
Releases a buffer obtained by getBuffer() or getBufferSetLength(), and sets its length.
\param newLength [in]  New buffer length.
\remarks
If newLength == -1, the buffer is treated as 0 terminated.

OdAnsiString.getBuffer(System.Int32)
\details
Returns a modifiable C style char array (buffer) of the specified minimum length for this String object.
\param minBufferLength [in]  Minimum buffer length.
\remarks
releaseBuffer() should be called before using any other OdAnsiString methods.
The pointer returned by this function is not valid after releaseBuffer() is called.

OdAnsiString.formatV(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte*)
\details
Assigns a value to this String object using a vsprintf-style format string and
argument list.
\param formatString [in]  Format string.
\param argList [in]  Argument list.
\returns
Returns a reference to this String Object.

OdAnsiString.format(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,BTEllipsis)
\details
Assigns a value to this String object using a printf-style format string and
arguments.
\param formatString [in]  Format string.
\returns
Returns a reference to this String Object.

OdAnsiString.find(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Int32)
\details
Returns the first occurrence of the specified character or string in this String object.
\param searchString [in]  Search string.
\param startIndex [in]  Start index.
\remarks
Returns -1 if not found.

OdAnsiString.find(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns the first occurrence of the specified string in this String object.
\param searchString [in]  Search string.
\remarks
Returns -1 if not found.

OdAnsiString.findOneOf(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns the first occurrence in this String object of any member of the specified character set.
\param charSet [in]  Character set.
\remarks
Returns -1 if not found.

OdAnsiString.find(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,System.Int32)
\details
Returns the first occurrence of the specified character in this String object.
\param searchChar [in]  Search character.
\param startIndex [in]  Start index.
\remarks
Returns -1 if not found.

OdAnsiString.reverseFind(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Returns the last occurrence of the specified character in this String object.
\param searchChar [in]  Search character.
\remarks
Returns -1 if not found.

OdAnsiString.find(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Returns the first occurrence of the specified character in this String object.
\param searchChar [in]  Search character.
\remarks
Returns -1 if not found.

OdAnsiString.deleteChars(System.Int32,System.Int32)
\details
Deletes the specified number characters from this String object.
\param deleteIndex [in]  Deletion index.
\param count [in]  Number of characters to delete.
\returns
Returns the new length of this String object.

OdAnsiString.insert(System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Inserts the specified string into this String object.
\param insertIndex [in]  Insertion index.
\param insertString [in]  String to insert.
\returns
Returns the new length of this String object.
\remarks
If insertIndex exceeds the length of this String object,
this String object is lengthened as necessary to accommodate the insertion.

OdAnsiString.insert(System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Inserts the specified character into this String object.
\param insertIndex [in]  Insertion index.
\param insertChar [in]  Character to insert.
\returns
Returns the new length of this String object.
\remarks
If insertIndex exceeds the length of this String object,
this String object is lengthened as necessary to accommodate the insertion.

OdAnsiString.remove(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Removes all occurrences of the specified character from this String object.
\param removeChar [in]  Character to remove.
\returns
Returns the number of characters removed.

OdAnsiString.replace(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Replaces all occurrences of the specified string in this String object.
\param oldString [in]  Old string.
\param newString [in]  New string.
\returns
Returns the number of characters or strings replaced.

OdAnsiString.replace(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Replaces all occurrences of the specified character in this String object.
\param oldChar [in]  Old character.
\param newChar [in]  New character.
\returns
Returns the number of characters or strings replaced.

OdAnsiString.trimLeft(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Removes all whitespace from the left side of this String object.
\param whiteChars [in]  Whitespace characters.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no other whitespace characters are specfied.

OdAnsiString.trimLeft(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Removes all whitespace from the left side of this String object.
\param whiteChar [in]  Whitespace character.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no other whitespace characters are specfied.

OdAnsiString.trimRight(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Removes all whitespace from the right side of this String object.
\param whiteChars [in]  Whitespace characters.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no whitespace characters are specfied.

OdAnsiString.trimRight(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\param whiteChar [in]  Whitespace character.
\details
Removes all whitespace from the right side of this String object.
\param whiteChar [in]  Whitespace character.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no whitespace characters are specfied.

OdAnsiString.trimLeft
\details
Removes all whitespace from the left side of this String object.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no other whitespace characters are specfied.

OdAnsiString.trimRight
\details
Removes all whitespace from the right side of this String object.
\returns
Returns a reference to this String object.
\remarks
A space (' ') is used if no whitespace characters are specfied.

OdAnsiString.makeReverse
\details
Reverses this String object.
\returns
Returns a reference to this String object.

OdAnsiString.makeLower
\details
Converts this String object to lower case.
\returns
Returns a reference to this String object.

OdAnsiString.makeUpper
\details
Converts this String object to upper case.
\returns
Returns a reference to this String object.

OdAnsiString.spanExcluding(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns the longest leftmost substring of this String object
that consists solely of characters that are
not contained in the specified character set.
\param charSet [in]  Character set.
\remarks
If the first character in this String object in the specified character set,
an empty string is returned.

OdAnsiString.spanIncluding(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Returns the longest leftmost substring of this String object
that consists solely of characters that are
contained in the specified character set.
\param charSet [in]  Character set.
\remarks
If the first character in this String object is not in the specified character set,
an empty string is returned.

OdAnsiString.right(System.Int32)
\details
Returns the rightmost substring of the specified length from this String object.
\param length [in]  Length of substring.

OdAnsiString.left(System.Int32)
\details
Returns the leftmost substring of the specified length from this String object.
\param length [in]  Length of substring.

OdAnsiString.mid(System.Int32)
\details
Returns the substring specified by a start indexfrom this String object.
\param startIndex [in]  Starting index.

OdAnsiString.mid(System.Int32,System.Int32)
\details
Returns the substring specified by a start index and a length from this String object.
\param startIndex [in]  Starting index.
\param length [in]  Length of substring.
\remarks
If length is not specified, the remainder of this String object is returned.

OdAnsiString.op_AdditionAssignment(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Concatenation-Equals Operator.
\remarks
Sets this object to the concatenation of this String object with the
value on the right, and returns a reference to this String object.

OdAnsiString.op_AdditionAssignment(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Concatenation-Equals Operator.
\remarks
Sets this object to the concatenation of this String object with the
value on the right, and returns a reference to this String object.

OdAnsiString.op_AdditionAssignment(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Concatenation-Equals Operator.
\remarks
Sets this object to the concatenation of this String object with the
value on the right, and returns a reference to this String object.

OdAnsiString.c_str
\details
Returns the underlying char array (buffer) of this String object.

OdAnsiString.setAt(System.Int32,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte)
\details
Sets the single character of this String object at the specified position.
\param charIndex [in]  Character index.
\param ch [in]  Character.
\remarks
No range checking is performed.

OdAnsiString.op_Subscript(System.Int32)
\details
Indexing Operator
\returns
Returns the single character of this String object at the specified position.
\param charIndex [in]  Character index.

OdAnsiString.getAt(System.Int32)
\details
Returns the single character of this String object at the specified position.
\param charIndex [in]  Character index.

OdAnsiString.empty
\details
Sets this String object to the empty string.

OdAnsiString.isEmpty
\details
Returns true and only if this String object is empty.

OdAnsiString.getLength
\details
Returns the number of characters in this String object.

OdAnsiString.#ctor(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte,System.Int32)
\param ch [in]  Character to repeat.
\param length [in]  Number of characters.

OdAnsiString.#ctor(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\param source [in]  Source.